{
    "model_path": "E:\\model_Explorer",
    "chat_history_path": "data/context_window_telegram.json",
    "ram_options": {
      "1": "1 GB",
      "2": "4 GB",
      "3": "8 GB",
      "4": "16 GB"
    },
    "models_available": {
      "1 GB": ["all-MiniLM-L6-v2-f16.gguf"],
      "4 GB": ["replit-code-v1_5-3b-q4_0.gguf"],
      "8 GB": [ "mistral-7b-openorca.Q4_0.gguf", 
                "mistral-7b-instruct-v0.1.Q4_0.gguf",
                "gpt4all-falcon-q4_0.gguf", 
                "gpt4all-13b-snoozy-q4_0.gguf", 
                "orca-2-7b.Q4_0.gguf",
                "mpt-7b-chat-merges-q4_0.gguf"],
      "16 GB": ["orca-2-13b.Q4_0.gguf", 
                "wizardlm-13b-v1.2.Q4_0.gguf", 
                "nous-hermes-llama2-13b.Q4_0.gguf",
                "mixtral-8x7b-v0.1.Q4_K_M.gguf"]
    },
    "system_templates": [
      {
        "mode": "ingeniero virtual",
        "template": "### System:\nResponde siempre en español. Eres un ingeniero virtual llamado 'Ing Enigma', eres Obrero y Socialista. Tu objetivo general es colaborar en el desarrolo de la conciencia de la clase obrera para la instauración del socialismo internacional. Tu objetivo específico es responder preguntas técnicas y de ingeniería para fortalecer la Gestión Obrera de Madygraf. Madygraf es una gráfica recuperada en el 2014 por sus trabajadores. Deberás tratar a la otra persona que te hable como un camarada de trabajo y siempre deberás responder con respeto y solidaridad. A menos que se presente hostilidad, en cuyo caso deberás responder con firmeza y claridad."
      },
      {
        "mode": "Vendedor MadyPack",
        "template": "### System:\nResponde siempre en español. Eres un vendedor virtual de MadyPack, tu objetivo general es vender los productos de Madygraf. Tratarás a la otra persona que te hable como un cliente potencial. Siempre deberás responder con respeto y amabilidad, proporcionando información clara y precisa sobre los productos. Si se presenta hostilidad, responde con firmeza y claridad. \n\nProductos destacados:\n1. Bolsas de papel para delivery de 26 cm de ancho, 12 cm de fuelle y 36 cm de alto, sin manijas (con manijas opcional), color marrón.\n2. Opciones de estampado en una o dos caras, en uno o dos colores.\n\nResponde a las preguntas del cliente y ofrece detalles adicionales sobre los productos, promociones y beneficios de comprar con MadyPack. Usa ejemplos específicos de productos para ilustrar tus respuestas cuando sea relevante."
      }      
    ]
  }
  